app/views/tasks/_form.html.erb

SELECT "groups".* FROM "groups"
---

<%= f.collection_select(:group_id, Group.all, :id, :name) %>