app/views/tasks/index.html.erb

	<td><%= t.text %></td>
	<td><%= Group.find(t.group_id).name %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]