app/views/tasks/show.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	<strong>Group:</strong>
	<%= Group.find(@task.group_id).name %><br>