Todo-Manager/app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
INSERT INTO "groups" ("created_at", "updated_at", "name", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-01-26 16:32:58.715983"], ["updated_at", "2018-01-26 16:32:58.715983"], ["name", "Group"], ["user_id", 1]]
---
    def create
        @group = current_user.groups.build(group_params)
        #@group.user = current_user
        if @group.save

UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "General"], ["updated_at", "2018-01-23 06:45:14.358999"], ["id", 1]]
---
    def update
        if @group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 5]]
---
    def destroy
        if @group.id == current_user.groups.first.id
            flash[:alert] = "Group " + @group.name + " cannot be deleted."
        else
            @group.destroy

SELECT  "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def set_groups
        @groups = current_user.groups