Todo-Manager/app/controllers/groups_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def overview
        @q = Task.ransack(params[:q])
        @tasks = Task.all