Todo-Manager/app/controllers/group_tasks_controller.rb

SELECT "groups".* FROM "groups"
---
    def show
        @group = @task.group_id

INSERT INTO "tasks" ("text", "created_at", "updated_at", "group_id", "ddl", "emergency", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["text", "ddd"], ["created_at", "2018-01-26 18:15:06.186604"], ["updated_at", "2018-01-26 18:15:06.186604"], ["group_id", 6], ["ddl", "2018-01-26"], ["emergency", "yes"], ["user_id", 2]]
---
    def create
        @task = @group.tasks.build(task_params)
        @task.user = current_user
        if @task.save

UPDATE "tasks" SET "group_id" = ?, "text" = ?, "ddl" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["group_id", 6], ["text", "LAF2201 HW"], ["ddl", "2018-01-25"], ["updated_at", "2018-01-24 16:28:27.071418"], ["id", 43]]
---
    def update
        if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 10]]
---
    def bulk_destroy
        ids = Array(params[:ids])
        tasks = ids.map{|id| Task.find_by_id(id)}
        tasks.each{ |t| t.destroy}

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 2]]
---
    def set_group
        @group = Group.find(params[:group_id])
        @groups = current_user.groups

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."group_id" = ? AND "tasks"."id" = ? LIMIT ?  [["group_id", 4], ["id", 15], ["LIMIT", 1]]
---
    def set_task
        @task = @group.tasks.find(params[:id])