Todo-Manager/app/controllers/welcome_controller.rb

    def index
        if current_user
            @groups=current_user.groups
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]