app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---

<% if current_user.groups.first %>