app/views/groups/overview.html.erb

	<tr style="text-align:center">
		<% group=Group.find(t.group_id) %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]