Todo-Manager/app/views/group_tasks/_form.html.erb

SELECT "groups".* FROM "groups"
---
<div id="form_head"><%= f.label :group, "Group" %></div><br>
<%= f.collection_select(:group_id, current_user.groups, :id, :name) %><br>