app/views/group_tasks/_form.html.erb

SELECT "groups".* FROM "groups"
---
<%= f.label :group, "Group" %><br>
<%= f.collection_select(:group_id, Group.all, :id, :name, class: "form-control") %><br>