app/views/group_tasks/search.html.erb

	<%= t.text %><br>
	<%= t.group.name %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]