app/views/group_tasks/show.html.erb

<strong>Group:</strong>
<%= Group.find(@task.group_id).name %><br>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]