app/controllers/group_tasks_controller.rb

SELECT "groups".* FROM "groups"
---
    def show
        @group = @task.group_id

INSERT INTO "tasks" ("text", "created_at", "updated_at", "group_id", "ddl", "emergency") VALUES (?, ?, ?, ?, ?, ?)  [["text", "CS2040 LAB"], ["created_at", "2018-01-24 16:30:16.336838"], ["updated_at", "2018-01-24 16:30:16.336838"], ["group_id", 6], ["ddl", "2018-02-01"], ["emergency", "yes"]]
---
    def create
        @task = @group.tasks.build(task_params)
        if @task.save

UPDATE "tasks" SET "group_id" = ?, "text" = ?, "ddl" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["group_id", 6], ["text", "LAF2201 HW"], ["ddl", "2018-01-25"], ["updated_at", "2018-01-24 16:28:27.071418"], ["id", 43]]
---
    def update
        if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 10]]
---
    def bulk_destroy
        ids = Array(params[:ids])
        tasks = ids.map{|id| Task.find_by_id(id)}
        tasks.each{ |t| t.destroy}

SELECT "groups".* FROM "groups"
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_group
        @groups = Group.all
        @group = Group.find(params[:group_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."group_id" = ? AND "tasks"."id" = ? LIMIT ?  [["group_id", 4], ["id", 15], ["LIMIT", 1]]
---
    def set_task
        @task = @group.tasks.find(params[:id])