app/controllers/groups_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def overview
        @tasks = Task.all

INSERT INTO "groups" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2018-01-22 06:25:17.217407"], ["updated_at", "2018-01-22 06:25:17.217407"], ["name", "Test"]]
---
    def create
        @group = Group.new(group_params)
        @group.save

UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "General"], ["updated_at", "2018-01-23 06:45:14.358999"], ["id", 1]]
---
    def update
        @group.update(group_params)

SELECT "groups".* FROM "groups"
---
    def set_groups
        @groups = Group.all