app/controllers/tasks_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @head = Group.find(@task.group_id).name

INSERT INTO "tasks" ("text", "created_at", "updated_at", "group_id", "ddl") VALUES (?, ?, ?, ?, ?)  [["text", "ddd"], ["created_at", "2018-01-17 12:34:26.049514"], ["updated_at", "2018-01-17 12:34:26.049514"], ["group_id", 1], ["ddl", "2018-03-17"]]
---
    def create
        @task = Task.new(task_params)
        @task.save

UPDATE "tasks" SET "ddl" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["ddl", "2018-01-17"], ["updated_at", "2018-01-17 13:44:02.767121"], ["id", 20]]
---
    def update
        @task.update(task_params)