Todo-Manager/app/views/groups/index.html.erb

SELECT  "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
<br><%= link_to 'Create a New Group', new_group_path, class: "btn btn-success btn-block"%>
<br><%= link_to 'Create a New Task', new_group_task_path(Group.first), class: "btn btn-success btn-block"%>