Todo-Manager/app/views/groups/overview.html.erb

	<% @tasks.each do |t|%>
		<% group=Group.find(t.group_id) %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]


<br><%= link_to 'Create', new_group_task_path(Group.first), class:"btn btn-success btn-block" %>
---
SELECT  "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]