Todo-Manager/app/views/groups/search.html.erb

		<tr style="text-align:center">
			<% @group = t.group.id %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]